nullstalgia/arduino-hardware-profiles/no_serial_micro/avr/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

menu.bootloader=Bootloader

menu.optimization=Olevel

##############################################################

micro.name=Micro W/O Serial (Normal Arduino)

micro.vid.0=0x2341
micro.pid.0=0x0037
micro.vid.1=0x2341
micro.pid.1=0x8037
micro.vid.2=0x2A03
micro.pid.2=0x0037
micro.vid.3=0x2A03
micro.pid.3=0x8037

micro.vid.4=0x2341
micro.pid.4=0x0237
# If the board is a 2341:0237 use 2341:8237 for build and set
# other parameters as well
micro.vid.4.build.vid=0x2341
micro.vid.4.build.pid=0x8237
micro.vid.4.build.usb_product="Genuino Micro"
micro.vid.4.bootloader.file=caterina/Caterina-Genuino-Micro.hex

micro.vid.5=0x2341
micro.pid.5=0x8237
# If the board is a 2341:8237 use 2341:8237 for build and set
# other paramters as well
micro.vid.5.build.vid=0x2341
micro.vid.5.build.pid=0x8237
micro.vid.5.build.usb_product="Genuino Micro"
micro.vid.5.bootloader.file=caterina/Caterina-Genuino-Micro.hex

micro.upload.tool=avrdude
micro.upload.protocol=avr109
micro.upload.maximum_size=28672
micro.upload.maximum_data_size=2560
micro.upload.speed=57600
micro.upload.disable_flushing=true
micro.upload.use_1200bps_touch=true
micro.upload.wait_for_upload_port=true

micro.bootloader.tool=avrdude
micro.bootloader.low_fuses=0xff
micro.bootloader.high_fuses=0xd8
micro.bootloader.extended_fuses=0xcb
micro.bootloader.file=caterina/Caterina-Micro.hex
micro.bootloader.unlock_bits=0x3F
micro.bootloader.lock_bits=0x2F

micro.build.mcu=atmega32u4
micro.build.f_cpu=16000000L
micro.build.vid=0x2341
micro.build.pid=0x8037
micro.build.usb_product="Arduino Micro"
micro.build.board=AVR_MICRO
micro.build.core=arduino
micro.build.variant=micro
micro.build.extra_flags={build.usb_flags}

##############################################################


suitmicro.name=Micro W/O Serial (DFU POSSIBLE)
suitmicro.vid.0=0x2341
suitmicro.pid.0=0x0037
suitmicro.vid.1=0x2341
suitmicro.pid.1=0x8037
suitmicro.vid.2=0x2A03
suitmicro.pid.2=0x0037
suitmicro.vid.3=0x2A03
suitmicro.pid.3=0x8037
suitmicro.vid.4=0x2341
suitmicro.pid.4=0x0237
 
suitmicro.menu.bootloader.dfu=DFU
suitmicro.menu.bootloader.dfu.upload.tool=dfu-programmer
suitmicro.menu.bootloader.dfu.upload.protocol=dfu
suitmicro.menu.bootloader.dfu.upload.maximum_size=28672
suitmicro.menu.bootloader.dfu.upload.maximum_data_size=2560
suitmicro.menu.bootloader.dfu.upload.speed=57600
suitmicro.menu.bootloader.dfu.upload.disable_flushing=true
suitmicro.menu.bootloader.dfu.upload.use_1200bps_touch=false                                  
suitmicro.menu.bootloader.dfu.upload.wait_for_upload_port=false
suitmicro.menu.bootloader.dfu.bootloader.file=32u4/DFU.hex

suitmicro.menu.bootloader.caterina=Caterina
suitmicro.menu.bootloader.caterina.upload.tool=avrdude
suitmicro.menu.bootloader.caterina.upload.protocol=avr109
suitmicro.menu.bootloader.caterina.upload.maximum_size=28672
suitmicro.menu.bootloader.caterina.upload.maximum_data_size=2560
suitmicro.menu.bootloader.caterina.upload.speed=57600
suitmicro.menu.bootloader.caterina.upload.disable_flushing=true
suitmicro.menu.bootloader.caterina.upload.use_1200bps_touch=true
suitmicro.menu.bootloader.caterina.upload.wait_for_upload_port=true
suitmicro.menu.bootloader.caterina.bootloader.file=32u4/Caterina.hex

suitmicro.bootloader.tool=avrdude
suitmicro.bootloader.low_fuses=0xff
suitmicro.bootloader.high_fuses=0xd8
suitmicro.bootloader.extended_fuses=0xcb
suitmicro.bootloader.unlock_bits=0x3F
suitmicro.bootloader.lock_bits=0x2F

suitmicro.build.mcu=atmega32u4
suitmicro.build.f_cpu=16000000L
suitmicro.build.vid=0x2341
suitmicro.build.pid=0x8037
suitmicro.build.usb_product="Micro"
suitmicro.build.board=AVR_MICRO
suitmicro.build.core=arduino
suitmicro.build.variant=micro

suitmicro.menu.optimization.size=Size
suitmicro.menu.optimization.size.build.extra_flags={build.usb_flags} -Os
suitmicro.menu.optimization.balance=Balance
suitmicro.menu.optimization.balance.build.extra_flags={build.usb_flags} -O2
suitmicro.menu.optimization.speed=Speed
suitmicro.menu.optimization.speed.build.extra_flags={build.usb_flags} -O3
suitmicro.build.extra_flags={build.usb_flags}
